In [11]:
# Dependencies
import pandas as pd
import numpy as np

In [12]:
# load files

indeed_file = 'Cleaned_Indeed_prior2ZipJoin.csv'
dice_file = 'clean_dice_data.csv'
diego_file = 'DataJobs_Companies_Loations.csv'

df_in = pd.read_csv(indeed_file, encoding="ISO-8859-1")
df_d = pd.read_csv(dice_file, encoding="ISO-8859-1")
df_do = pd.read_csv(diego_file, encoding="ISO-8859-1")

In [13]:
df_do.head()

,Unnamed: 0,JobTitle,Company,Cities,State
0,0,Data Engineer,\n Apple,Santa Clara Valley,CA
1,1,Data Engineer,\n National Oilwell Varco,Houston,TX
2,2,Data Engineer,\n Bank of America,Charlotte,NC
3,3,Python Developer,\n Booz Allen Hamilton,Herndon,VA
4,4,Data Scientist,\n C.H. Robinson,Eden Prairie,MN

In [14]:
# drop index col


df_do = df_do[['JobTitle', 'Company', 'Cities', 'State']]


df_do.head()

           JobTitle                       Company              Cities State
0     Data Engineer                   \n    Apple  Santa Clara Valley    CA
1     Data Engineer  \n    National Oilwell Varco             Houston    TX
2     Data Engineer         \n    Bank of America           Charlotte    NC
3  Python Developer     \n    Booz Allen Hamilton             Herndon    VA
4    Data Scientist           \n    C.H. Robinson        Eden Prairie    MN

In [15]:
#rename columns

df_do.rename(columns={'JobTitle': 'Job Title', 'Company': 'Company', 'Cities': 'City', 'State' : 'State'}, inplace=True)

df_do.head()

          Job Title                       Company                City State
0     Data Engineer                   \n    Apple  Santa Clara Valley    CA
1     Data Engineer  \n    National Oilwell Varco             Houston    TX
2     Data Engineer         \n    Bank of America           Charlotte    NC
3  Python Developer     \n    Booz Allen Hamilton             Herndon    VA
4    Data Scientist           \n    C.H. Robinson        Eden Prairie    MN

In [16]:
#rename columns

df_in.rename(columns={'position': 'Job Title', 'company': 'Company', 'City': 'City', 'State' : 'State'}, inplace=True)

df_in.head()

        Job Title         Company     City State
0  Data Scientist  Xpert Staffing  ATLANTA    GA
1    Data Analyst  Operation HOPE  ATLANTA    GA
2  Data Scientist        Cotiviti  ATLANTA    GA
3  Data Scientist     Relus Cloud  ATLANTA    GA
4  Data Scientist  Inspire Brands  ATLANTA    GA

In [17]:
# Select specific columns

df_d = df_d[['Job Title', 'Company', 'City', 'State']]
df_d.head()

,Job Title,Company,City,State
0,AUTOMATION TEST ENGINEER,"Digital Intelligence Systems, LLC",Atlanta,GA
1,Information Security Engineer,University of Chicago/IT Services,Chicago,IL
2,Business Solutions Architect,"Galaxy Systems, Inc.",Schaumburg,IL
3,"Java Developer (mid level)- FT- GREAT culture,...",TransTech LLC,Bolingbrook,IL
4,DevOps Engineer,Matrix Resources,Atlanta,GA

In [18]:
df = pd.DataFrame

In [19]:
frames = [df_in, df_d]

result = pd.concat(frames)

In [20]:
frames_2 = [result, df_do]

final = pd.concat(frames_2)

In [21]:
final.head()

        Job Title         Company     City State
0  Data Scientist  Xpert Staffing  ATLANTA    GA
1    Data Analyst  Operation HOPE  ATLANTA    GA
2  Data Scientist        Cotiviti  ATLANTA    GA
3  Data Scientist     Relus Cloud  ATLANTA    GA
4  Data Scientist  Inspire Brands  ATLANTA    GA

In [ ]:
df_in.shape

In [ ]:
df_d.shape

In [ ]:
result.shape

In [22]:
final.shape

(23028, 4)

In [24]:
# Save cleaned data to csv

result.to_csv("Append_Final.csv", index=False)